## 데이터 사이언스 스쿨 

>링크 : https://datascienceschool.net/intro.html  
>참고 : https://passwd.tistory.com/entry/Python-Pandas-Series-1


## Serise

```
-> list            -> array              -> serise
series.tolist()    series.to_numpy()     pandas.serise(array)   
arrary.tolist()    numpy.array(list)     pandas.serise(list)  
```

Series methodes
```
.to_numpy  
.to_list  / tolist
.at  
.iat  
.loc
.ilic
.itmes
.round
.mod
.apply
.agg
.groupby
.rolling
.any
.all
.corr
.count
.max
.median
.mean
.mode
.skew
.std
.var
.unique / nunique / is_unique
.isin
.isnull / isna
.fillna
.mask  / where
.head / tail
.sort_values / .sort_index
.stack / .unstack
.squeez
.resample
```

In [44]:
import numpy as np
import pandas as pd

In [45]:
s = pd.Series([9904312, 3448737, 2890451, 2466052],
              index=["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [46]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [47]:
s.values

array([9904312, 3448737, 2890451, 2466052])

In [48]:
s[0:3]

서울    9904312
부산    3448737
인천    2890451
dtype: int64

In [49]:
s0 = pd.Series(range(3), index=["a", "b", "c"])
s0

a    0
b    1
c    2
dtype: int64

In [50]:
s0.a

0

In [51]:
s0['a']

0

In [52]:
s0.loc['a']

0

In [53]:
s2 = pd.Series({"서울": 9631482, "부산": 3393191, "인천": 2632035, "대전": 1490158})
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [54]:
ds = s - s2
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [55]:
ds = s + s2
ds

대구           NaN
대전           NaN
부산     6841928.0
서울    19535794.0
인천     5522486.0
dtype: float64

## DataFrame

```
-> DataFrame : dp.DataFrame( np.array | list | dict | series)  /  serise.to_frame()
DataFrame -> : df.values  (df.to_arrary()) / df.value.tolist() / df.to_dict()   
```

In [56]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [57]:
# df.서울  (index 는 df.으로 접근할 수 없다., column은 가능)
# df[colum][row] 는 가능 : df[col]가 serise이므로 'serise[index]' 로 인식함.
# df[0] 은 문자열 column 인 경우 사용 불가. (정수형 column 인 경우는 OK)  -> 문자 column인 경우  iloc[0:1] 사용

# df.colum, df[column] vs df[row : ]
# loc[row] vs loc[ : , col]
# iloc[row_int] vs iloc[ : , col_int]

print(df['서울':'서울'])
# print(df['2010':'2000']) column은 왜 안되는 거야?
print(df[0:1])
print(df.iloc[0:1])
# 이렇게 사용하지 말고, 

print(df.loc['서울'])

# 이렇게 사용하자

df[df.index == '서울']

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
지역                   수도권
2015             9904312
2010             9631482
2005             9762546
2000             9853972
2010-2015 증가율     0.0283
Name: 서울, dtype: object

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283

In [58]:
df.loc['서울'].squeeze()

지역                   수도권
2015             9904312
2010             9631482
2005             9762546
2000             9853972
2010-2015 증가율     0.0283
Name: 서울, dtype: object

In [59]:
# df['서울']    # 은 '서울'은 index 이다, col 을 기대해서 오류가 난다

print(df['2010'])

df['2010']['서울']    # 이 정상적인 이유는 'df['2010'] 이 index 가 있는 Serise 이고, 이 series[index] 을 한 경과 이다.'

서울    9631482
부산    3393191
인천    2632035
대구    2431774
Name: 2010, dtype: int64

9631482

In [60]:
df.지역

서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [61]:
# (1) 모든 도시의 2010 인구수를 시리즈로 나타낸다.

df['2010']

서울    9631482
부산    3393191
인천    2632035
대구    2431774
Name: 2010, dtype: int64

In [62]:
# (2) 모든 도시의 2015와 2005 인구수를 데이터 프레임으로 나타낸다.

df[['2015','2005']]

       2015     2005
서울  9904312  9762546
부산  3448737  3512547
인천  2890451  2517680
대구  2466052  2456016

In [63]:
# (3) 모든 도시의 각 해 평균 인구수를 새로운 열로 추가한다.
del df['지역']

In [64]:
print(df.mean(axis='columns'))
df['mean']= df.mean(axis='columns')    #계산되는 값은 columns 이다. 
df

서울    7.830462e+06
부산    2.801982e+06
인천    2.101301e+06
대구    1.965566e+06
dtype: float64

       2015     2010     2005     2000  2010-2015 증가율          mean
서울  9904312  9631482  9762546  9853972         0.0283  7.830462e+06
부산  3448737  3393191  3512547  3655437         0.0163  2.801982e+06
인천  2890451  2632035  2517680  2466338         0.0982  2.101301e+06
대구  2466052  2431774  2456016  2473990         0.0141  1.965566e+06

In [65]:
# (4) 인천의 2010년 인구수를 2632030 으로 수정하고 평균 점수도 다시 계산한다.

print(df['2010'])
print(type(df['2010']))
print((df['2010']['인천']))     # serise['인천']

서울    9631482
부산    3393191
인천    2632035
대구    2431774
Name: 2010, dtype: int64
<class 'pandas.core.series.Series'>
2632035

In [66]:
# (5) 대구의 인구수를 데이터프레임으로 나타낸다.
# (6) 서울의 인구수를 시리즈로 나타낸다.

## loc, iloc

In [67]:
# col 2010 값이 3백만 보다 큰 row 들 의 2015 col 값

df.loc[df['2010'] > 3_000_000, '2015' ]     

# df.loc[ index , column ] 형태 /  (df['2010'] > 3_000_000) 는 조건에 true 인 index 를 리턴

서울    9904312
부산    3448737
Name: 2015, dtype: int64

In [68]:
print(df.loc[:,'2010']>3_000_000)
# (df['2010'] > 3_000_000) 와 같은 조건에 true인 index 를 리턴

df[df.loc[:,'2010']>3_000_000].loc[:,'2015']

# df[index].loc[:,column] 형태

서울     True
부산     True
인천    False
대구    False
Name: 2010, dtype: bool

서울    9904312
부산    3448737
Name: 2015, dtype: int64

In [69]:
df.loc['서울':'부산','2015']

서울    9904312
부산    3448737
Name: 2015, dtype: int64

In [70]:
df[0:2].loc[:,'2015']

서울    9904312
부산    3448737
Name: 2015, dtype: int64

In [71]:
filt = df['2015'] < 3000000 
filt2 = df['2000'] >2460000

print(filt)
print(filt2)
print(filt&filt2)
# df[df.loc[:,'2010'] < 2500000]

print(df[0:4][df[0:4].loc[:,'2010'] < 2500000])

df[filt&filt2][df[filt&filt2].loc[:,'2010'] < 2500000]

# Unalignable boolean Series provided as indexer (index of the boolean Series and of the indexed object do not match).

서울    False
부산    False
인천     True
대구     True
Name: 2015, dtype: bool
서울    True
부산    True
인천    True
대구    True
Name: 2000, dtype: bool
서울    False
부산    False
인천     True
대구     True
dtype: bool
       2015     2010     2005     2000  2010-2015 증가율          mean
대구  2466052  2431774  2456016  2473990         0.0141  1.965566e+06

       2015     2010     2005     2000  2010-2015 증가율          mean
대구  2466052  2431774  2456016  2473990         0.0141  1.965566e+06

In [72]:
df[filt&filt2].loc[df[filt&filt2]['2010']<2500000]

       2015     2010     2005     2000  2010-2015 증가율          mean
대구  2466052  2431774  2456016  2473990         0.0141  1.965566e+06

indexing 결론

series.index_lable / siries['index_label'] df 와 혼동되니 사용하지 말자 / series.loc['index_lable']  

**df['column_label']**  / df.column_label  
**df.loc['index_label']**  /df.loc[index_int]

df.iloc[index_int]  / df[index_int]


slicing 결론  

```df.loc['index_label_start':'stop', 'coulmn_lable_start':'stop']```

contidion (boolean) 결론

전제 dataframe 의 index 와 조건 dataframe 의 index  을 맞추어야 한다.  
```df.loc[조건,columns]```

## Methods
### count() / values_count()

In [73]:
# 각 column 별 row 값 갯수
df.count()

2015             4
2010             4
2005             4
2000             4
2010-2015 증가율    4
mean             4
dtype: int64

In [74]:
df.value_counts()

# 이건 무순 말이지?

2015     2010     2005     2000     2010-2015 증가율  mean
2466052  2431774  2456016  2473990  0.0141         1.965566e+06    1
2890451  2632035  2517680  2466338  0.0982         2.101301e+06    1
3448737  3393191  3512547  3655437  0.0163         2.801982e+06    1
9904312  9631482  9762546  9853972  0.0283         7.830462e+06    1
dtype: int64

In [75]:
df.loc[:,'2015'].count()

4

In [76]:

df.loc[:,'2015'].value_counts()

9904312    1
3448737    1
2890451    1
2466052    1
Name: 2015, dtype: int64

### drop() / T / astype()

In [77]:
# del df['2010-2015 증가율']   ## df 에 바로 적용되므로  위 코드에서 df 을 재 계산하면 값이 달라진다.

print(df)

# df2 = df.drop('2010-2015 증가율',axis='columns')   # column 삭제, df 원본에 영향을 주지 않고, 새로은 df2 생성

print(df[df['2015']<9000000])                            # 삭제 대상 row
df2 = df.drop(df.loc[df.loc[:,'2015']<9000000,].index)   # row 삭제 (조건 부분에 row 가 변함)

print(df2)
print(df)

       2015     2010     2005     2000  2010-2015 증가율          mean
서울  9904312  9631482  9762546  9853972         0.0283  7.830462e+06
부산  3448737  3393191  3512547  3655437         0.0163  2.801982e+06
인천  2890451  2632035  2517680  2466338         0.0982  2.101301e+06
대구  2466052  2431774  2456016  2473990         0.0141  1.965566e+06
       2015     2010     2005     2000  2010-2015 증가율          mean
부산  3448737  3393191  3512547  3655437         0.0163  2.801982e+06
인천  2890451  2632035  2517680  2466338         0.0982  2.101301e+06
대구  2466052  2431774  2456016  2473990         0.0141  1.965566e+06
       2015     2010     2005     2000  2010-2015 증가율          mean
서울  9904312  9631482  9762546  9853972         0.0283  7.830462e+06
       2015     2010     2005     2000  2010-2015 증가율          mean
서울  9904312  9631482  9762546  9853972         0.0283  7.830462e+06
부산  3448737  3393191  3512547  3655437         0.0163  2.801982e+06
인천  2890451  2632035  2517680  2466338         0.0982  2.101301e+06
대구  2466052  2431774  2456016  2473990         0.0141  1.965566e+06

In [78]:
df3 = df2.T
print(df3.dtypes)
df3 = df3.astype(int)
print(df3.dtypes)
df3

서울    float64
dtype: object
서울    int64
dtype: object

                    서울
2015           9904312
2010           9631482
2005           9762546
2000           9853972
2010-2015 증가율        0
mean           7830462

### sum()  / mean()

In [79]:
df3.mean(axis=1)

2015             9904312.0
2010             9631482.0
2005             9762546.0
2000             9853972.0
2010-2015 증가율          0.0
mean             7830462.0
dtype: float64

In [80]:
print(type(df3.mean(axis=1)))

print(df3.mean(axis=1)[['2005','2000']])
print(df3.mean(axis=1)[[2,3]])
print(df3.mean(axis=1)[2:4])
df3.mean(axis=1).loc[['2005','2000']]

<class 'pandas.core.series.Series'>
2005    9762546.0
2000    9853972.0
dtype: float64
2005    9762546.0
2000    9853972.0
dtype: float64
2005    9762546.0
2000    9853972.0
dtype: float64

2005    9762546.0
2000    9853972.0
dtype: float64

### apply() / lambda()

https://aplab.tistory.com/entry/pandas-apply

In [86]:
df

       2015     2010     2005     2000  2010-2015 증가율          mean
서울  9904312  9631482  9762546  9853972         0.0283  7.830462e+06
부산  3448737  3393191  3512547  3655437         0.0163  2.801982e+06
인천  2890451  2632035  2517680  2466338         0.0982  2.101301e+06
대구  2466052  2431774  2456016  2473990         0.0141  1.965566e+06

In [85]:
df4 = df.copy()
df4.apply(lambda x : x.max()- x.min() ,axis='columns')

# df 에 적용되었으므로 x 에 각 행(series)이 들어가 column을 계산한다.

서울    9.904312e+06
부산    3.655437e+06
인천    2.890451e+06
대구    2.473990e+06
dtype: float64

In [92]:
def funX (dfX):
    return dfX.max()-dfX.min()        # 각 행이 전달되고, 해당 행의 series.max - series.min 이 리턴된다.

df4.apply(funX, axis=1)

서울    9.904312e+06
부산    3.655437e+06
인천    2.890451e+06
대구    2.473990e+06
dtype: float64

In [39]:
df3['서울'].apply(lambda x : x *10)

# df.Series 에 적용되었으므로 x에 Series 의 개별값이 들어 간다. (df.map() 같은???)

2015             99043120
2010             96314820
2005             97625460
2000             98539720
2010-2015 증가율           0
mean             78304620
Name: 서울, dtype: int64

###  notnull(), notna() /  isnull(), isna()

In [99]:
print(df3.apply(pd.value_counts))
print(type(df3.apply(pd.value_counts)))

df3.apply(pd.value_counts).notnull()

          서울   부산   인천   대구
1965566  NaN  NaN  NaN  1.0
2101300  NaN  NaN  1.0  NaN
2431774  NaN  NaN  NaN  1.0
2456016  NaN  NaN  NaN  1.0
2466052  NaN  NaN  NaN  1.0
2466338  NaN  NaN  1.0  NaN
2473990  NaN  NaN  NaN  1.0
2517680  NaN  NaN  1.0  NaN
2632035  NaN  NaN  1.0  NaN
2801982  NaN  1.0  NaN  NaN
2890451  NaN  NaN  1.0  NaN
3393191  NaN  1.0  NaN  NaN
3448737  NaN  1.0  NaN  NaN
3512547  NaN  1.0  NaN  NaN
3655437  NaN  1.0  NaN  NaN
7830462  1.0  NaN  NaN  NaN
9631482  1.0  NaN  NaN  NaN
9762546  1.0  NaN  NaN  NaN
9853972  1.0  NaN  NaN  NaN
9904312  1.0  NaN  NaN  NaN
<class 'pandas.core.frame.DataFrame'>

            서울     부산     인천     대구
1965566  False  False  False   True
2101300  False  False   True  False
2431774  False  False  False   True
2456016  False  False  False   True
2466052  False  False  False   True
2466338  False  False   True  False
2473990  False  False  False   True
2517680  False  False   True  False
2632035  False  False   True  False
2801982  False   True  False  False
2890451  False  False   True  False
3393191  False   True  False  False
3448737  False   True  False  False
3512547  False   True  False  False
3655437  False   True  False  False
7830462   True  False  False  False
9631482   True  False  False  False
9762546   True  False  False  False
9853972   True  False  False  False
9904312   True  False  False  False

In [39]:
df3.apply(pd.value_counts).isnull()

            서울     부산     인천     대구
1965566   True   True   True  False
2101300   True   True  False   True
2431774   True   True   True  False
2456016   True   True   True  False
2466052   True   True   True  False
2466338   True   True  False   True
2473990   True   True   True  False
2517680   True   True  False   True
2632035   True   True  False   True
2801982   True  False   True   True
2890451   True   True  False   True
3393191   True  False   True   True
3448737   True  False   True   True
3512547   True  False   True   True
3655437   True  False   True   True
7830462  False   True   True   True
9631482  False   True   True   True
9762546  False   True   True   True
9853972  False   True   True   True
9904312  False   True   True   True

### fillna() / dropna()

In [107]:
qdata = df3.apply(pd.value_counts)['서울'].fillna(0).astype(int)
qdata

1965566    0
2101300    0
2431774    0
2456016    0
2466052    0
2466338    0
2473990    0
2517680    0
2632035    0
2801982    0
2890451    0
3393191    0
3448737    0
3512547    0
3655437    0
7830462    1
9631482    1
9762546    1
9853972    1
9904312    1
Name: 서울, dtype: int64

In [112]:
qcut =pd.cut(qdata,bins=[-100,0,100],labels=['음수', '양수'])
qcut

1965566    음수
2101300    음수
2431774    음수
2456016    음수
2466052    음수
2466338    음수
2473990    음수
2517680    음수
2632035    음수
2801982    음수
2890451    음수
3393191    음수
3448737    음수
3512547    음수
3655437    음수
7830462    양수
9631482    양수
9762546    양수
9853972    양수
9904312    양수
Name: 서울, dtype: category
Categories (2, object): ['음수' < '양수']

In [106]:
qcat = pd.qcut(qdata.index, 4, labels=["Q1", "Q2", "Q3", "Q4"])
qcat

['Q1', 'Q1', 'Q1', 'Q1', 'Q1', ..., 'Q4', 'Q4', 'Q4', 'Q4', 'Q4']
Length: 20
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

### replace() / query() / isin()

## multi-index
### groupby

In [117]:
np.random.seed(0)
df4 = pd.DataFrame(np.round(np.random.randn(5, 4), 2),
                   columns=[["A", "A", "B", "B"],
                            ["C1", "C2", "C1", "C2"]])
df4

      A           B
     C1    C2    C1    C2
0  1.76  0.40  0.98  2.24
1  1.87 -0.98  0.95 -0.15
2 -0.10  0.41  0.14  1.45
3  0.76  0.12  0.44  0.33
4  1.49 -0.21  0.31 -0.85

In [145]:
df5 = pd.DataFrame(np.round(np.random.randn(5,4),2),columns=list('ABbC'),index=list('abcde'))
df5

      A     B     b     C
a -1.49  0.44  0.17  0.64
b  2.38  0.94 -0.91  1.12
c -1.32 -0.46 -0.07  1.71
d -0.74 -0.83 -0.10 -0.66
e  1.13 -1.08 -1.15 -0.44

In [149]:
df5.columns.str.lower().is_unique

# colume 이 각각 소문자와 대문자로 표시된 동일한 colume 이 존재

False

In [168]:
df5.columns = df5.columns.str.upper()     # columns 을 모두 upper로 reset
df5.groupby(level=0,axis=1).mean()     # 동일한 columns 을 구룹화해서 평균값 넣기

      A      B     C
a -1.49  0.305  0.64
b  2.38  0.015  1.12
c -1.32 -0.265  1.71
d -0.74 -0.465 -0.66
e  1.13 -1.115 -0.44

In [157]:
df5

      A     B     B     C
a -1.49  0.44  0.17  0.64
b  2.38  0.94 -0.91  1.12
c -1.32 -0.46 -0.07  1.71
d -0.74 -0.83 -0.10 -0.66
e  1.13 -1.08 -1.15 -0.44

### set_index() / reset_index()

      A     B     C     D
a -2.55  0.65  0.86 -0.74
b  2.27 -1.45  0.05 -0.19
c  1.53  1.47  0.15  0.38
d -0.89 -1.98 -0.35  0.16
e  1.23  1.20 -0.39 -0.30

## groupby object

### groupby metho
```
size, count: 그룹 데이터의 갯수
mean, median, min, max: 그룹 데이터의 평균, 중앙값, 최소, 최대
sum, prod, std, var, quantile : 그룹 데이터의 합계, 곱, 표준편차, 분산, 사분위수
first, last: 그룹 데이터 중 가장 첫번째 데이터와 가장 나중 데이터
agg, aggregate : 또는 여러가지 그룹연산을 동시에 하고 싶은 경우 함수 이름 문자열의 리스트를 전달한다.
describe : 하나의 그룹 대표값이 아니라 여러개의 값을 데이터프레임으로 구한다.
apply : describe 처럼 하나의 대표값이 아닌 데이터프레임을 출력하지만 원하는 그룹연산이 없는 경우에 사용한다.
transform : 그룹에 대한 대표값을 만드는 것이 아니라 그룹별 계산을 통해 데이터 자체를 변형한다.
```

### pivot table

In [128]:
pdata = {
    "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
    "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
    "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
    "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}
columns = ["도시", "연도", "인구", "지역"]
pdf= pd.DataFrame(pdata, columns=columns)
pdf

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

In [169]:
pdf.pivot('도시','연도','인구').fillna(0).astype(int)

연도     2005     2010     2015
도시
부산  3512547  3393191  3448737
서울  9762546  9631482  9904312
인천        0   263203  2890451

In [141]:
pdf.set_index(["도시", "연도"])[["인구"]]#.unstack()

              인구
도시 연도
서울 2015  9904312
   2010  9631482
   2005  9762546
부산 2015  3448737
   2010  3393191
   2005  3512547
인천 2015  2890451
   2010   263203

## merge() / join() / concat()